docker_exp/docker_test/vm/stress_10000_16.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.244 (be patient)


Server Software:        Apache/2.4.17
Server Hostname:        192.168.0.244
Server Port:            80

Document Path:          /OS_ORDER_16.txt
Document Length:        16384 bytes

Concurrency Level:      100
Time taken for tests:   14.514 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      166340000 bytes
HTML transferred:       163840000 bytes
Requests per second:    689.00 [#/sec] (mean)
Time per request:       145.139 [ms] (mean)
Time per request:       1.451 [ms] (mean, across all concurrent requests)
Transfer rate:          11192.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2   39  29.5     33    1076
Processing:     9  106  23.7    111     343
Waiting:        6   52  22.3     49     257
Total:         11  145  26.2    145    1142

Percentage of the requests served within a certain time (ms)
  50%    145
  66%    145
  75%    146
  80%    146
  90%    147
  95%    147
  98%    149
  99%    152
 100%   1142 (longest request)