docker_exp/docker_test/vm/stress_10000_4.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.244 (be patient)


Server Software:        Apache/2.4.17
Server Hostname:        192.168.0.244
Server Port:            80

Document Path:          /OS_ORDER_4.txt
Document Length:        4096 bytes

Concurrency Level:      100
Time taken for tests:   4.115 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      43450000 bytes
HTML transferred:       40960000 bytes
Requests per second:    2429.96 [#/sec] (mean)
Time per request:       41.153 [ms] (mean)
Time per request:       0.412 [ms] (mean, across all concurrent requests)
Transfer rate:          10310.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   20   4.3     20      30
Processing:     1   21   9.7     21     144
Waiting:        1   20   3.8     20      48
Total:          2   41   9.2     41     170

Percentage of the requests served within a certain time (ms)
  50%     41
  66%     41
  75%     41
  80%     41
  90%     41
  95%     41
  98%     41
  99%    109
 100%    170 (longest request)