docker_exp/docker_test/vm/stress_10000_64.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.244 (be patient)


Server Software:        Apache/2.4.17
Server Hostname:        192.168.0.244
Server Port:            80

Document Path:          /OS_ORDER_64.txt
Document Length:        65536 bytes

Concurrency Level:      100
Time taken for tests:   56.193 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      657870000 bytes
HTML transferred:       655360000 bytes
Requests per second:    177.96 [#/sec] (mean)
Time per request:       561.934 [ms] (mean)
Time per request:       5.619 [ms] (mean, across all concurrent requests)
Transfer rate:          11432.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1   85  34.7     82     163
Processing:    57  476  35.2    480     570
Waiting:        8   88  29.7     88     161
Total:         58  561  10.5    562     663

Percentage of the requests served within a certain time (ms)
  50%    562
  66%    562
  75%    562
  80%    562
  90%    562
  95%    563
  98%    563
  99%    564
 100%    663 (longest request)